ecommerce/app/controllers/products_controller.rb

SELECT "products".* FROM "products" WHERE (name LIKE '%bag4%')
SELECT "products".* FROM "products"
---
  def index
    if params[:q]
      search_term = params[:q]
      if(Rails.env.development?)
        @products = Product.where("name LIKE ?", "%#{search_term}%")
      else
        # use ilike for case insensitivity on postres
        @products = Product.where("name ilike ?", "%#{search_term}%")
      end
    else
      @products = Product.all

SELECT  "comments".* FROM "comments" WHERE "comments"."product_id" = ? ORDER BY created_at DESC LIMIT ? OFFSET ?  [["product_id", 1], ["LIMIT", 3], ["OFFSET", 0]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."product_id" = ?  [["product_id", 1]]
---
  def show
    @comments = @product.comments.order("created_at DESC").paginate(:page => params[:page], :per_page => 3)

INSERT INTO "products" ("name", "description", "image_url", "created_at", "updated_at", "colour", "price") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "image_url" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["image_url", "C:\\Users\\nagesh\\Downloads\\Compressed\\ecommerce-master\\public"], ["updated_at", 2017-04-06 08:02:03 UTC], ["id", 1]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)